# 需求:输入某年某月某日，判断这一天是这一年的第几天？
# 思路:以5月20日为例，应该先把前四个月的加起来，然后再加上20天即本年的第几天
# 特殊情况就是: 如果年份为闰年且输入月份大于2时需考虑多加一天
 

year = int(input("年:"))
month = int(input("月:"))
day = int(input("日:"))
sum_day = 0  # 第几天
leap_year = 0  # 闰年
 
# 使用元组定义天数
# 如果输入的月份是1月份，则直接计算day即可
# 如果输入的月份是2月份，则要先计算出1月份的天数，即为31天
# 以此类推
# 1  2   3   4   5    6    7    8    9    10   11   12
# 0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334
months = (0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334)
# 根据输入的月份，计算出前几个月的天数
if 0 < month <= 12:
    sum_day = months[month - 1]
else:
    print("输入的月份有误")
# 判断是否为闰年:
# 1.能被400整除 或者是 2.能被4整除并且不能被100整除
if year % 400 == 0 or (year % 4 == 0 and year % 100 != 0):
    # 如果是闰年 则将leap_year变为1
    leap_year = 1
 
# 判断如果是闰年并且输入的月份大于2则在总的天数上加1
if leap_year == 1 and month > 2:
    sum_day += day + 1
else:
    sum_day += day

print(f"it is the {sum_day}th day.")  # 打印
